app/controllers/posts_controller.rb

  def index
    if params[:author_id]
      #params[:author_id] coming from? Rails provides it for us through the nested route,
      #The conditional hinges on whether there's an :author_id key in the params hash — in other words, whether the user navigated to /authors/:id/posts
      @posts = Author.find(params[:author_id]).posts
      #accccounts for the new nest urls, so see if the user is tryting to access all pots or all post form a particular author
    else
      @posts = Post.all
---
SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 4]]
SELECT "posts".* FROM "posts" WHERE (created_at >='2016-01-27 00:00:00.000000')
SELECT "authors".* FROM "authors"
SELECT "posts".* FROM "posts"